Hm... also #1849 could be related.

But anyway, I can't reproduce the issue with a simple test creating new template & cloning a VM.

Template:
```hcl
resource "proxmox_virtual_environment_vm" "template" {
  name      = "template"
  node_name = "pve"
  machine   = "q35"
  started   = false
  template  = true

  disk {
    datastore_id = "local-lvm"
    file_id      = proxmox_virtual_environment_download_file.ubuntu_cloud_image.id
    interface    = "virtio0"
    iothread     = true
    discard      = "on"
    size         = 20
  }

  network_device {
    bridge = "vmbr0"
  }

  vga {
    type = "virtio"
  }
}

resource "proxmox_virtual_environment_download_file" "ubuntu_cloud_image" {
  content_type = "iso"
  datastore_id = "local"
  node_name    = "pve"

  url = "http://devfs/jammy/current/jammy-server-cloudimg-amd64.img"
}
```
The original disk is in the `local-lvm` datastore.

Clone, moving disk to the `tank` datastore:
```hcl
resource "proxmox_virtual_environment_vm" "clone" {
  node_name       = "pve"
  name            = "clone"
  started         = true
  stop_on_destroy = true

  clone {
    vm_id = proxmox_virtual_environment_vm.template.vm_id
  }

  disk {
    datastore_id = "tank"
    interface    = "virtio0"
    iothread     = true
    discard      = "on"
    size         = 20
  }

  initialization {
    dns {
      servers = ["172.16.0.15", "172.16.0.16"]
      domain = "example.com"
    }
    ip_config {
      ipv4 {
        address = "192.168.3.233/24"
        gateway = "192.168.3.1"
      }
    }

    user_account {
      username = "ubuntu"
      password = "password"
    }
  }
}
``` 
Note the `size` attribute on disk. It is required now when cloning with changing disk attributes. You don't have it in the clone config, but error is different. I guess it fails before resizing the disk.

This example applied successfully without errors:
```
❯ tofu apply -auto-approve
OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # proxmox_virtual_environment_download_file.ubuntu_cloud_image will be created
  + resource "proxmox_virtual_environment_download_file" "ubuntu_cloud_image" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "pve"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "http://devfs/jammy/current/jammy-server-cloudimg-amd64.img"
      + verify              = true
    }

  # proxmox_virtual_environment_vm.clone will be created
  + resource "proxmox_virtual_environment_vm" "clone" {
      + acpi                    = true
      + bios                    = "seabios"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "clone"
      + network_interface_names = (known after apply)
      + node_name               = "pve"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = true
      + tablet_device           = true
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + clone {
          + full    = true
          + retries = 1
          + vm_id   = (known after apply)
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "tank"
          + discard           = "on"
          + file_format       = (known after apply)
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 20
          + ssd               = false
        }

      + initialization {
          + datastore_id = "local-lvm"

          + dns {
              + domain  = "example.com"
              + servers = [
                  + "172.16.0.15",
                  + "172.16.0.16",
                ]
            }

          + ip_config {
              + ipv4 {
                  + address = "192.168.3.233/24"
                  + gateway = "192.168.3.1"
                }
            }

          + user_account {
              + password = (sensitive value)
              + username = "ubuntu"
            }
        }
    }

  # proxmox_virtual_environment_vm.template will be created
  + resource "proxmox_virtual_environment_vm" "template" {
      + acpi                    = true
      + bios                    = "seabios"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "template"
      + network_interface_names = (known after apply)
      + node_name               = "pve"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + stop_on_destroy         = false
      + tablet_device           = true
      + template                = true
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = (known after apply)
          + file_id           = (known after apply)
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 20
          + ssd               = false
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + vga {
          + memory = 16
          + type   = "virtio"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
proxmox_virtual_environment_download_file.ubuntu_cloud_image: Creating...
proxmox_virtual_environment_download_file.ubuntu_cloud_image: Creation complete after 1s [id=local:iso/jammy-server-cloudimg-amd64.img]
proxmox_virtual_environment_vm.template: Creating...
proxmox_virtual_environment_vm.template: Still creating... [10s elapsed]
proxmox_virtual_environment_vm.template: Creation complete after 14s [id=100]
proxmox_virtual_environment_vm.clone: Creating...
proxmox_virtual_environment_vm.clone: Still creating... [10s elapsed]
proxmox_virtual_environment_vm.clone: Still creating... [20s elapsed]
proxmox_virtual_environment_vm.clone: Still creating... [30s elapsed]
proxmox_virtual_environment_vm.clone: Still creating... [40s elapsed]
proxmox_virtual_environment_vm.clone: Still creating... [50s elapsed]
proxmox_virtual_environment_vm.clone: Still creating... [1m0s elapsed]
proxmox_virtual_environment_vm.clone: Still creating... [1m10s elapsed]
proxmox_virtual_environment_vm.clone: Still creating... [1m20s elapsed]
proxmox_virtual_environment_vm.clone: Creation complete after 1m21s [id=101]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
``` 

<img width="961" alt="Image" src="https://github.com/user-attachments/assets/cb0d6f5b-768f-4fd2-9d4f-a4bb843979b3" />


@TomaszDom would you mind sharing the current state of the VM? (i guess you can use `tofu state show module.ubuntu_vms["zi-i-waf-1"].proxmox_virtual_environment_vm.ubuntu24_template_vm`)

I suspect there is an issue with upgrading the existing state to the new version.
 